In [29]:
import pandas as pd
import numpy as np

In [2]:
obj1 = pd.Series([1,2,3,4,5], index=["A","B","C","D","E"])
obj1

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [13]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data, columns=["pop","year","state", ""])
frame

   pop  year   state
0  1.5  2000    Ohio  NaN
1  1.7  2001    Ohio  NaN
2  3.6  2002    Ohio  NaN
3  2.4  2001  Nevada  NaN
4  2.9  2002  Nevada  NaN
5  3.2  2003  Nevada  NaN

In [21]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame2 = pd.DataFrame(pop)
frame2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [23]:
obj3 = pd.Series(range(3), index=['a', 'b', 'c'])
obj3.index

Index(['a', 'b', 'c'], dtype='object')

In [44]:
data2 = pd.DataFrame(np.arange(9).reshape((3,3)), 
                     index=['a','c','b'], 
                     columns=["Kumasi", "Accra", "Takoradi"])
data2

   Kumasi  Accra  Takoradi
a       0      1         2
c       3      4         5
b       6      7         8

In [48]:
data2.drop('Takoradi', axis=1)

   Kumasi  Accra
a       0      1
c       3      4
b       6      7

In [54]:
data3 = pd.DataFrame(np.random.rand(4,3), index=["Accra", "Kumasi","Takoradi","Sunyani"], columns=['a','b','c'])
data3

                 a         b         c
Accra     0.595379  0.545998  0.599125
Kumasi    0.744940  0.633649  0.899595
Takoradi  0.889708  0.947912  0.818240
Sunyani   0.448759  0.842658  0.099173

In [55]:
data3.apply(lambda x: x+1, axis='columns')

                 a         b         c
Accra     1.595379  1.545998  1.599125
Kumasi    1.744940  1.633649  1.899595
Takoradi  1.889708  1.947912  1.818240
Sunyani   1.448759  1.842658  1.099173

In [ ]:
data3.map(lambda x: x+2)

                 a         b         c
Accra     2.595379  2.545998  2.599125
Kumasi    2.744940  2.633649  2.899595
Takoradi  2.889708  2.947912  2.818240
Sunyani   2.448759  2.842658  2.099173